In [1]:
import pandas as pd

In [2]:
fruit_data = {"Fruit": ['Apple','Avacado','Banana','Strawberry','Grape'],"Color": ['Red','Green','Yellow','Pink','Green'],
"Price": [45, 90, 60, 37, 49]
}

fruit_data

{'Fruit': ['Apple', 'Avacado', 'Banana', 'Strawberry', 'Grape'],
 'Color': ['Red', 'Green', 'Yellow', 'Pink', 'Green'],
 'Price': [45, 90, 60, 37, 49]}

Turn this data sets into DataFrame

In [3]:
data = pd.DataFrame(fruit_data)

In [4]:
data

        Fruit   Color  Price
0       Apple     Red     45
1     Avacado   Green     90
2      Banana  Yellow     60
3  Strawberry    Pink     37
4       Grape   Green     49

UPDATING COLUMNS

To rename any column name we can use the rename function in the data set

In [5]:
data.rename(columns = {"Fruit":"Fruit Name"})

   Fruit Name   Color  Price
0       Apple     Red     45
1     Avacado   Green     90
2      Banana  Yellow     60
3  Strawberry    Pink     37
4       Grape   Green     49

UPDATING MULTIPLE COLUMNS

In [6]:
data.rename(columns = {"Color":"Color Name", "Price":"Fruit Price"})

        Fruit Color Name  Fruit Price
0       Apple        Red           45
1     Avacado      Green           90
2      Banana     Yellow           60
3  Strawberry       Pink           37
4       Grape      Green           49

UPDATE COLUMN CASE LETTERS

In [7]:
data.columns.str.lower()
data

        Fruit   Color  Price
0       Apple     Red     45
1     Avacado   Green     90
2      Banana  Yellow     60
3  Strawberry    Pink     37
4       Grape   Green     49

data

UPDATING ROW VALUES

First we have to locate the row and then we update the data in the row

In [8]:
#updating rows

data.loc[3]

Fruit    Strawberry
Color          Pink
Price            37
Name: 3, dtype: object

In [9]:
#update

data.loc[3] = ['PineApple','Yellow','48']
data

       Fruit   Color Price
0      Apple     Red    45
1    Avacado   Green    90
2     Banana  Yellow    60
3  PineApple  Yellow    48
4      Grape   Green    49

UPDATE ONLY FEW DATA NEED TO UPDATE NOT ENTIRE ROW

First we have to locate the row and ten update specific data

In [11]:
#update specific values

data.loc[3, ['Price']]

Price    48
Name: 3, dtype: object

In [12]:
#updating 

data.loc[3, ['Price']] = [65]
data

       Fruit   Color Price
0      Apple     Red    45
1    Avacado   Green    90
2     Banana  Yellow    60
3  PineApple  Yellow    65
4      Grape   Green    49

Upate the any data in row from condition

In [13]:
#Condition

updated = data['Price'] > 60
updated

0    False
1     True
2    False
3     True
4    False
Name: Price, dtype: bool

In [14]:
#Updating

data.loc[updated, 'Price'] = 'Expensive'
data

       Fruit   Color      Price
0      Apple     Red         45
1    Avacado   Green  Expensive
2     Banana  Yellow         60
3  PineApple  Yellow  Expensive
4      Grape   Green         49